Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/court_of_appeal.html.txt.tmx
Source language: en
Languages: ga

source: • Appealing Court of Appeal decisions
ga: • Cinntí na Cúirte Achomhairc a achomharc

source: The Court of Appeal was established on 28 October 2014 under the Court of Appeal Act 2014
ga: Bunaíodh an Chúirt Achomhairc an 28 Deireadh Fómhair 2014 faoin Acht um an gCúirt Achomhairc, 2014

source: Its main function is to hear appeals from the High Court and the Circuit Court
ga: Is é a príomhfheidhm éisteacht le hachomhairc ón Ard-Chúirt agus ón gCúirt Chuarda

source: It took over the role of the Court of Criminal Appeal and the Courts-Martial Appeal Court which were abolished
ga: Ghlac sí ceannas ar ról na Cúirte Achomhairc Choiriúil agus Chúirt Achomhairc na nArmchúirteanna ar cuireadh deireadh leo

source: The only appeals that go to the Supreme Court are those which raise issues of major public importance or where the interests of justice require such an appeal
ga: Is iad an t-aon achomhairc a ghabhann a fhad leis an gCúirt Uachtarach iad siúd ina dtugtar saincheisteanna lena mbaineann tábhacht mhór phoiblí chun solais nó ina dteastaíonn an t-achomharc sin ar mhaithe leis an gceartas

source: The Court of Appeal has a President and up to 9 judges
ga: Tá Uachtarán agus a mhéid le 9 mbreitheamh sa Chúirt Achomhairc

source: The Chief Justice and the President of the High Court are additional judges
ga: Breithiúna breise iad Príomh-Bhreitheamh agus Uachtarán na hArd-Chúirte

source: The President of the Appeal Court is an additional judge of the Supreme Court and of the High Court
ga: Breitheamh breise den Chúirt Uachtarach agus den Ard-Chúirt is ea Uachtarán na Cúirte Achomhairc

source: The President distributes and allocates the work of the Court of Appeal
ga: Déanann an tUachtarán obair na Cúirte Achomhairc a scaipeadh agus a leithdháileadh

source: Matters coming before it are normally heard and determined by 3 judges
ga: Is gnách go n-éisteann 3 bhreitheamh le saincheisteanna a thagann os comhair na cúirte anuas ar chinneadh a dhéanamh orthu

source: However, some interlocutory and procedural applications may be heard by the President or another nominated judge alone
ga: D’fhéadfadh an tUachtarán nó breitheamh eile a ainmnítear éisteacht le roinnt iarratais idirbhreitheacha agus nós imeachta ar bhonn aonair, áfach

source: An interlocutory application is an application for a temporary decision to deal with issues that will be finally decided when the case is fully heard
ga: Is ionann iarratas idirbhreitheach agus iarratas ar chinneadh sealadach chun déileáil le saincheisteanna a ndéanfar cinneadh orthu ar deireadh nuair a éisteadh leis an gcás ina iomláine

source: Procedural applications could include, for example, an application for legal aid
ga: I measc na n-iarratas nós imeachta, mar shampla, d’fhéadfaí iarratas ar chúnamh dlíthiúil a áireamh

source: The Court of Appeal is not a court of local or limited jurisdiction
ga: Ní cúirt dlínse áitiúil nó dlínse teoranta an Chúirt Achomhairc

source: The Court of Appeal has jurisdiction in civil proceedings:
ga: Tá dlínse ag an gCúirt Achomhairc in imeachtaí sibhialta:

source: • It can hear appeals from decisions of the High Court except for those cases where the Supreme Court has permitted an appeal to it
ga: • Is féidir leis an gCúirt éisteacht le hachomhairc ó chinntí na hArd-Chúirte seachas i dtaobh na gcásanna siúd inar cheadaigh an Chúirt Uachtarach achomharc a dhéanamh léi

source: • It may give a ruling on a question of law submitted to it by the Circuit Court
ga: • Féadfaidh sí rialáil a thabhairt ar cheist dlí a gcuireann an Chúirt Chuarda faoina bráid

source: • It can hear appeals from cases heard in the High Court about whether or not a law is constitutional
ga: • Féadfaidh sí éisteacht le hachomhairc ó chásanna ar éisteadh leo san Ard-Chúirt faoi cé acu an bhfuil nó nach bhfuil dlí bunreachtúil

source: The Court of Appeal hears appeals against convictions or sentences given by the Circuit Criminal Court, the Central Criminal Court (High Court) and the Special Criminal Court
ga: Éisteann an Chúirt Achomhairc le hachomhairc i gcoinne ciontuithe nó pianbhreitheanna a thugann an Chúirt Choiriúil Chuarda, an Phríomh-Chúirt Chuarda (an Ard-Chúirt) agus an Chúirt Choiriúil Speisialta

source: The Director of Public Prosecutions can appeal to the Court of Appeal:
ga: Féadfaidh an Stiúrthóir Ionchúiseamh Poiblí achomharc a dhéanamh leis an gCúirt Achomhairc:

source: • A decision not to order a retrial
ga: • Cinneadh gan atriail a ordú

source: The Director of Public Prosecutions can also appeal a point of law from a trial on indictment to the Court of Appeal
ga: Chomh maith leis sin, féadfaidh an Stiúrthóir Ionchúiseamh Poiblí achomharc a dhéanamh ar phointe dlí ó thriail ar díothú leis an gCúirt Achomhairc

source: This does not mean that the Court may overturn the verdict of "not guilty"
ga: Ní chiallaíonn seo gur féidir leis an gCúirt fíorasc “neamhchiontach” a chur ar ceal

source: It simply clarifies the law for future cases
ga: Ní dhéanann sé ach an dlí a shoiléiriú ar mhaithe le cásanna amach anseo

source: Although criminal cases are heard and determined by 3 judges, the Court of Appeal gives one judgment unless there is a constitutional issue involved
ga: Cé go n-éisteann 3 bhreitheamh le cásanna coiriúla, tugann an Chúirt Achomhairc breithiúnas amháin mura bhfuil saincheist bhunreachtúil i gceist

source: The existence of a dissenting opinion is not made public
ga: Ní dhéantar tuairim phoiblí de más ann do thuairim easaontach

source: Courts-Martial are military courts
ga: Cúirteanna míleata iad na hArmchúirteanna

source: They deal with offences against military law by members of the Defence Forces
ga: Déileálann siad le cionta i gcoinne an dlí mhíleata ag comhaltaí na bhFórsaí Cosanta

source: The Court of Appeal hears appeals from people who had been convicted by a Court-Martial
ga: Éisteann an Chúirt Achomhairc le hachomhairc ó dhaoine a ndearna Armchúirt iad a chiontú

source: Information on the court-martial system is available at military.ie
ga: Tá fáil ar fhaisnéis ar chóras na n-armchúirteanna ag military.ie

source: Appealing Court of Appeal decisions
ga: Cinntí na Cúirte Achomhairc a achomharc

source: Decisions of the Court of Appeal can only be appealed to the Supreme Court:
ga: Ní féidir cinntí na Cúirte Achomhairc a achomharc ach leis an gCúirt Uachtarach:

source: • If the decision involves a matter of general public importance, or
ga: • Má bhaineann ceist lena mbaineann tábhacht ghinearálta phoiblí leis an gcinneadh, nó

source: • If, in the interests of justice, it is necessary that there be an appeal
ga: • Más gá, ar mhaithe le ceartas, go ndéantar achomharc

source: You can find further information on the Court of Appeal on the Courts Service website
ga: Tá fáil ar bhreis faisnéise ar an gCúirt Achomhairc ar láithreán gréasáin na Seirbhíse Cúirteanna
